In [1]:
# initial imports
import pandas as pd
from path import Path
import numpy as np

In [2]:
# Load data
file_path = Path("../Resources/loans_data.csv")
loans_df = pd.read_csv(file_path)
loans_df.head()

   amount  term      month  age             education  gender  bad
0    1000    30       June   45  High School or Below    male    0
1    1000    30       July   50              Bachelor  female    0
2    1000    30     August   33              Bachelor  female    0
3    1000    15  September   27               college    male    0
4    1000    30    October   28               college  female    0

In [3]:
month_num = {
    "January": 1,
    "February": 2,
    "March": 3,
    "April": 4,
    "May": 5,
    "June": 6,
    "July": 7,
    "August": 8,
    "September": 9,
    "October": 10,
    "November": 11,
    "December": 12
}

In [4]:
loans_df['month_nmbr'] = loans_df.month.apply(lambda x: month_num[x])
loans_df.head(5)

   amount  term      month  age             education  gender  bad  month_nmbr
0    1000    30       June   45  High School or Below    male    0           6
1    1000    30       July   50              Bachelor  female    0           7
2    1000    30     August   33              Bachelor  female    0           8
3    1000    15  September   27               college    male    0           9
4    1000    30    October   28               college  female    0          10

In [5]:
loans_df = pd.get_dummies(loans_df, columns=["education","gender"])

In [6]:
loans_df.drop('month', axis=1, inplace=True)

In [7]:
loans_df.head()

,amount,term,age,bad,month_nmbr,education_Bachelor,education_High School or Below,education_Master or Above,education_college,gender_female,gender_male
0,1000,30,45,0,6,0,1,0,0,0,1
1,1000,30,50,0,7,1,0,0,0,1,0
2,1000,30,33,0,8,1,0,0,0,1,0
3,1000,15,27,0,9,0,0,0,1,0,1
4,1000,30,28,0,10,0,0,0,1,1,0

In [8]:
file_path = Path("../Resources/loans_data_encoded.csv")
loans_df.to_csv(file_path, index=False)

In [9]:
from sklearn.preprocessing import StandardScaler
data_scaler = StandardScaler()

In [10]:
loans_data_scaled = data_scaler.fit_transform(loans_df)

In [11]:
loans_data_scaled[:5]

array([[ 0.49337687,  0.89789115,  2.28404253, -0.81649658, -0.16890147,
        -0.39336295,  1.17997648, -0.08980265, -0.88640526, -0.42665337,
         0.42665337],
       [ 0.49337687,  0.89789115,  3.10658738, -0.81649658,  0.12951102,
         2.54218146, -0.84747452, -0.08980265, -0.88640526,  2.34382305,
        -2.34382305],
       [ 0.49337687,  0.89789115,  0.3099349 , -0.81649658,  0.42792352,
         2.54218146, -0.84747452, -0.08980265, -0.88640526,  2.34382305,
        -2.34382305],
       [ 0.49337687, -0.97897162, -0.67711892, -0.81649658,  0.72633602,
        -0.39336295, -0.84747452, -0.08980265,  1.12815215, -0.42665337,
         0.42665337],
       [ 0.49337687,  0.89789115, -0.51260995, -0.81649658,  1.02474851,
        -0.39336295, -0.84747452, -0.08980265,  1.12815215,  2.34382305,
        -2.34382305]])

In [12]:
print(np.mean(loans_data_scaled[:,0]))
print(np.std(loans_data_scaled[:,0]))

-3.552713678800501e-16
0.9999999999999999

In [13]:
loans_data_scaled.shape

(500, 11)